Revit 2027 API
ParameterTypeId.RailingPathCurvePropertiesSlopeOption Property
 "Rail Slope": Built-in param used for overriding railing curve slope in a sketch via UI
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingPathCurvePropertiesSlopeOption { get; }
Public Shared ReadOnly Property RailingPathCurvePropertiesSlopeOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingPathCurvePropertiesSlopeOption {
	ForgeTypeId^ get ();
}
static member RailingPathCurvePropertiesSlopeOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace